In [15]:
import pandas as pd
import numpy as np

In [16]:
data = pd.read_csv("data+files/realtor-data.csv", parse_dates=["prev_sold_date"])

In [17]:
data.sample(2)

,status,bed,bath,acre_lot,city,state,zip_code,house_size,prev_sold_date,price
713563,for_sale,2.0,1.0,0.03,Lakewood,New Jersey,8701.0,982.0,NaT,160000.0
781195,for_sale,4.0,5.0,NaN,New York City,New York,10075.0,2881.0,NaT,8250000.0

In [18]:
def max_min(x):
    return pd.Series({"max":x.max(), "min": x.min()})

In [19]:
max_min(data.bed)

max    123.0
min      1.0
dtype: float64

Como apply funciona:
- Series.apply(func): Aplica uma função a cada valor de uma Series.
- DataFrame.apply(func, axis=0): Aplica uma função a cada coluna de um DataFrame.
- DataFrame.apply(func, axis=1): Aplica uma função a cada linha de um DataFrame.

In [20]:
data[["bed", "bath", "price"]].apply(max_min, axis=0)

       bed   bath        price
max  123.0  198.0  875000000.0
min    1.0    1.0          0.0

In [21]:
data[["bed", "bath", "price"]]

        bed  bath     price
0       3.0   2.0  105000.0
1       4.0   2.0   80000.0
2       2.0   1.0   67000.0
3       4.0   2.0  145000.0
4       6.0   2.0   65000.0
...     ...   ...       ...
904961  2.0   2.0  359000.0
904962  2.0   2.0  299000.0
904963  NaN   1.0  120000.0
904964  3.0   2.0  449000.0
904965  3.0   3.0  850000.0

[904966 rows x 3 columns]

apply é lento...

In [22]:
data.loc[0:100,["bed", "bath", "price"]].apply(max_min, axis=1)

          max      min
0    105000.0      2.0
1     80000.0      2.0
2     67000.0      1.0
3    145000.0      2.0
4     65000.0      2.0
..        ...      ...
96    31179.0  31179.0
97   500000.0      3.0
98   225000.0      2.0
99    28000.0  28000.0
100  425000.0      2.0

[101 rows x 2 columns]

In [29]:
#map
def count_len(x):
    return len(str(x))

data.head()
# data.map() # descontinuado?

,status,bed,bath,acre_lot,city,state,zip_code,house_size,prev_sold_date,price
0,for_sale,3.0,2.0,0.12,Adjuntas,Puerto Rico,601.0,920.0,NaT,105000.0
1,for_sale,4.0,2.0,0.08,Adjuntas,Puerto Rico,601.0,1527.0,NaT,80000.0
2,for_sale,2.0,1.0,0.15,Juana Diaz,Puerto Rico,795.0,748.0,NaT,67000.0
3,for_sale,4.0,2.0,0.10,Ponce,Puerto Rico,731.0,1800.0,NaT,145000.0
4,for_sale,6.0,2.0,0.05,Mayaguez,Puerto Rico,680.0,NaN,NaT,65000.0

In [31]:
# lambda
data.apply(lambda x: len(str(x)))

status            252
bed               195
bath              196
acre_lot          211
city              305
state             284
zip_code          244
house_size        235
prev_sold_date    279
price             252
dtype: int64

In [ ]:
def max_min(x):
    return pd.Series({"max":x.max(), "min": x.min()})

In [33]:
data.loc[0:100,["bed", "bath", "price"]].apply(lambda x: pd.Series({"max":x.max(), "min": x.min()}))

     bed  bath       price
max  9.0   7.0  10000000.0
min  1.0   1.0     28000.0